# 연습문제1
25+99
456-123
2*(3+4)
(3+5*6)/7
(7-4)*3
2^10 + 3^5
1256%%7
184%%5
1976/24
(16*25) + (126*5) + (67*22)


# 연습문제2-1
pi <- 3.14
r1 <- 10
r2 <- 15
r3 <- 20

r1*r1*pi
r2*r2*pi
r3*r3*pi

# 연습문제2-2
x <- c(6,8,10)
y <- 2*x^2 + 5*x + 10
y


# 연습문제3
d <- 101:200
d
dF[10]
d[90:100]
tail(d,10)
d[seq(2,100,2)]
d[d%%2==0]
d.20 <- d[1:20]
d.20
d.20[-5]
d.20[-c(5,7,9)]

# 연습문제4
d1 <- 1:50
d2 <- 51:100
d1
d2
d1+d2
d2-d1
d1*d2
d2/d1
sum(d1); sum(d2)
sum(d1,d2)
max(d2); min(d2)
mean(d2); mean(d1); mean(d2) - mean(d1)
sort(d1, decreasing=T)
d1_sort <- sort(d1, decreasing=T)[1:10]
d2_sort <- sort(d2, decreasing=T)[1:10]
d3 <- c(d1_sort,d2_sort)
d3
length(d3)

# 연습문제5
v1 <- 51:90
v1[v1<60]
sum(v1<70)
sum(v1[v1>65])
v1[ v1>60 & v1<73 ]
v1[ v1<65 | v1>80 ]
v1[ v1%%7==3 ]
sum( v1[ v1%%2==0 ] )
v1[ v1%%3==0 | v1>80 ]
v1[ v1%%3==0 & v1%%5==0 ]
